# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.00  # scales module repeats
width_multiple: 1.00  # scales convolution channels

# YOLOv8.0l backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# SN neck&head
head:
  - [-1, 1, SNI, [1024, 2]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [ -1, 1, Conv, [ 256, 1, 1 ] ]
  - [ -2, 1, Conv, [ 256, 1, 1 ] ]
  - [ -1, 1, GSConvE, [ 128, 3, 1 ] ]
  - [ -1, 1, Conv, [ 128, 3, 1 ] ]
  - [ -1, 1, Conv, [ 128, 3, 1 ] ]
  - [ -1, 1, Conv, [ 128, 3, 1 ] ]
  - [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ]
#  - [ -1, 1, Conv, [ 256, 1, 1 ] ] # 19-----
  - [-1, 1, C2f, [256]]

  - [-1, 1, SNI, [256, 2]]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [ -1, 1, Conv, [ 128, 1, 1 ] ]
  - [ -2, 1, Conv, [ 128, 1, 1 ] ]
  - [ -1, 1, GSConvE, [ 64, 3, 1 ] ]
  - [ -1, 1, Conv, [ 64, 3, 1 ] ]
  - [ -1, 1, Conv, [ 64, 3, 1 ] ]
  - [ -1, 1, Conv, [ 64, 3, 1 ] ]
  - [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ]
  - [ -1, 1, Conv, [ 128, 1, 1 ] ] # 29----
  - [ -1, 1, Conv, [ 128, 1, 1 ] ]
  - [ -2, 1, Conv, [ 128, 1, 1 ] ]
  - [ -1, 1, GSConvE, [ 64, 3, 1 ] ]
  - [ -1, 1, Conv, [ 64, 3, 1 ] ]
  - [ -1, 1, Conv, [ 64, 3, 1 ] ]
  - [ -1, 1, Conv, [ 64, 3, 1 ] ]
  - [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ]
#  - [ -1, 1, Conv, [ 128, 1, 1 ] ] # 37
  - [-1, 1, C2f, [128]]

  - [-1, 1, GSConvE, [256, 3, 2]] # or ESD/2
  - [[-1, 19], 1, Concat, [1]]  # cat head P4
  - [ -1, 1, Conv, [ 256, 1, 1 ] ]
  - [ -2, 1, Conv, [ 256, 1, 1 ] ]
  - [ -1, 1, GSConvE, [ 128, 3, 1 ] ]
  - [ -1, 1, Conv, [ 128, 3, 1 ] ]
  - [ -1, 1, Conv, [ 128, 3, 1 ] ]
  - [ -1, 1, Conv, [ 128, 3, 1 ] ]
  - [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ]
  - [ -1, 1, Conv, [ 256, 1, 1 ] ] # 39-----
  - [ -1, 1, Conv, [ 256, 1, 1 ] ]
  - [ -2, 1, Conv, [ 256, 1, 1 ] ]
  - [ -1, 1, GSConvE, [ 128, 3, 1 ] ]
  - [ -1, 1, Conv, [ 128, 3, 1 ] ]
  - [ -1, 1, Conv, [ 128, 3, 1 ] ]
  - [ -1, 1, Conv, [ 128, 3, 1 ] ]
  - [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ]
#  - [ -1, 1, Conv, [ 256, 1, 1 ] ] # 55
  - [-1, 1, C2f, [256]]

  - [-1, 1, GSConvE, [512, 3, 2]] # or ESD/2
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [ -1, 1, Conv, [ 512, 1, 1 ] ]
  - [ -2, 1, Conv, [ 512, 1, 1 ] ]
  - [ -1, 1, GSConvE, [ 256, 3, 1 ] ]
  - [ -1, 1, Conv, [ 256, 3, 1 ] ]
  - [ -1, 1, Conv, [ 256, 3, 1 ] ]
  - [ -1, 1, Conv, [ 256, 3, 1 ] ]
  - [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ]
  - [ -1, 1, Conv, [ 512, 1, 1 ] ] # 49
  - [ -1, 1, Conv, [ 512, 1, 1 ] ]
  - [ -2, 1, Conv, [ 512, 1, 1 ] ]
  - [ -1, 1, GSConvE, [ 256, 3, 1 ] ]
  - [ -1, 1, Conv, [ 256, 3, 1 ] ]
  - [ -1, 1, Conv, [ 256, 3, 1 ] ]
  - [ -1, 1, Conv, [ 256, 3, 1 ] ]
  - [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ]
#  - [ -1, 1, Conv, [ 512, 1, 1 ] ] # 73
  - [-1, 1, C2f, [512]]

  - [[37, 55, 73], 1, Detect, [nc]]  # Detect(P3, P4, P5)
