# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# SN2-IHP
head:
  [[4, 1, GSConvE, [256, 3, 1]],
   [-1, 3, C3, [256, False]],  # 11 (P3/8-small)

   [6, 1, GSConvE, [512, 3, 1]],
   [-1, 6, C3, [512, False]],  # 13 (P4/16-medium)

   [9, 1, GSConvE, [1024, 3, 1]],
   [-1, 9, C3, [1024, False]],  # 15 (P5/32-large)

   [[11, 13, 15], 1, Detect, [nc]],  # Detect(P3, P4, P5)
  ]